In [191]:
import numpy as np
import pandas as pd

Series : A one-dimensional labeled array holding data of any type
DataFrame: A two-dimensional data structure that holds data like a two-dimension array or a table with rows and columns

In [192]:
s= pd.Series([1,3,5,np.nan,6,9])

In [193]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [194]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list("ABCD"))

In [195]:
df

                   A         B         C         D
2013-01-01 -0.109838 -0.157917 -1.068249 -0.886861
2013-01-02 -1.431959 -0.675223 -0.013039 -1.146839
2013-01-03  0.051613 -0.833165 -1.076762 -0.107108
2013-01-04  0.251971  0.662593  0.372430  0.703250
2013-01-05  1.512808 -0.011024  0.011468 -1.934990
2013-01-06 -0.087220 -0.882336 -0.722322 -1.032973

In [196]:
df2 = pd.DataFrame(
    {
        "A":5.00,
        "B":pd.Timestamp("20130102"), 
        "C":pd.Series(1,index=list(range(4)), dtype = "float32"),
        "D":np.array([3]*4, dtype="int32"),
        "E":pd.Categorical(["test","train","test","train"]),
        "F":"Hi"
    }
)
df2

     A          B    C  D      E   F
0  5.0 2013-01-02  1.0  3   test  Hi
1  5.0 2013-01-02  1.0  3  train  Hi
2  5.0 2013-01-02  1.0  3   test  Hi
3  5.0 2013-01-02  1.0  3  train  Hi

In [197]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [198]:
df2.head()

     A          B    C  D      E   F
0  5.0 2013-01-02  1.0  3   test  Hi
1  5.0 2013-01-02  1.0  3  train  Hi
2  5.0 2013-01-02  1.0  3   test  Hi
3  5.0 2013-01-02  1.0  3  train  Hi

In [199]:
df.tail(2)

                   A         B         C         D
2013-01-05  1.512808 -0.011024  0.011468 -1.934990
2013-01-06 -0.087220 -0.882336 -0.722322 -1.032973

In [200]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [201]:
df.to_numpy()

array([[-0.10983799, -0.15791728, -1.0682494 , -0.88686113],
       [-1.43195909, -0.67522333, -0.0130386 , -1.14683885],
       [ 0.05161311, -0.83316529, -1.07676181, -0.10710835],
       [ 0.25197108,  0.662593  ,  0.37242955,  0.70325036],
       [ 1.5128078 , -0.01102378,  0.01146777, -1.93498979],
       [-0.0872196 , -0.88233586, -0.72232155, -1.03297281]])

In [202]:
df2.to_numpy()

array([[5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'Hi']],
      dtype=object)

In [203]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.109838   -1.431959    0.051613    0.251971    1.512808   -0.087220
B   -0.157917   -0.675223   -0.833165    0.662593   -0.011024   -0.882336
C   -1.068249   -0.013039   -1.076762    0.372430    0.011468   -0.722322
D   -0.886861   -1.146839   -0.107108    0.703250   -1.934990   -1.032973

In [204]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-06 -0.087220 -0.882336 -0.722322 -1.032973
2013-01-03  0.051613 -0.833165 -1.076762 -0.107108
2013-01-02 -1.431959 -0.675223 -0.013039 -1.146839
2013-01-01 -0.109838 -0.157917 -1.068249 -0.886861
2013-01-05  1.512808 -0.011024  0.011468 -1.934990
2013-01-04  0.251971  0.662593  0.372430  0.703250

In [205]:
df["A"]

2013-01-01   -0.109838
2013-01-02   -1.431959
2013-01-03    0.051613
2013-01-04    0.251971
2013-01-05    1.512808
2013-01-06   -0.087220
Freq: D, Name: A, dtype: float64

In [206]:
df[0:1]

                   A         B         C         D
2013-01-01 -0.109838 -0.157917 -1.068249 -0.886861

In [207]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01 -0.109838 -0.157917
2013-01-02 -1.431959 -0.675223
2013-01-03  0.051613 -0.833165
2013-01-04  0.251971  0.662593
2013-01-05  1.512808 -0.011024
2013-01-06 -0.087220 -0.882336

In [208]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [209]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [210]:
df.loc["20130102":"20130103"]
print(df)

                   A         B         C         D
2013-01-01 -0.109838 -0.157917 -1.068249 -0.886861
2013-01-02 -1.431959 -0.675223 -0.013039 -1.146839
2013-01-03  0.051613 -0.833165 -1.076762 -0.107108
2013-01-04  0.251971  0.662593  0.372430  0.703250
2013-01-05  1.512808 -0.011024  0.011468 -1.934990
2013-01-06 -0.087220 -0.882336 -0.722322 -1.032973

Selection by Location of Label

In [211]:
df.loc[dates[0],"A"]

np.float64(-0.1098379864359864)

In [212]:
df.at[dates[0],"A"]

np.float64(-0.1098379864359864)

Selection by Position || .iloc means selecting by integer based location ,, not by actual index

In [213]:
df.iloc[3]

A    0.251971
B    0.662593
C    0.372430
D    0.703250
Name: 2013-01-04 00:00:00, dtype: float64

In [214]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.251971  0.662593
2013-01-05  1.512808 -0.011024

In [215]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -1.431959 -0.013039
2013-01-03  0.051613 -1.076762
2013-01-05  1.512808  0.011468

In [216]:
df.iloc[1:3,]

                   A         B         C         D
2013-01-02 -1.431959 -0.675223 -0.013039 -1.146839
2013-01-03  0.051613 -0.833165 -1.076762 -0.107108

In [217]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.157917 -1.068249
2013-01-02 -0.675223 -0.013039
2013-01-03 -0.833165 -1.076762
2013-01-04  0.662593  0.372430
2013-01-05 -0.011024  0.011468
2013-01-06 -0.882336 -0.722322

In [218]:
df.iloc[1,1]

np.float64(-0.6752233309380106)

In [219]:
df

                   A         B         C         D
2013-01-01 -0.109838 -0.157917 -1.068249 -0.886861
2013-01-02 -1.431959 -0.675223 -0.013039 -1.146839
2013-01-03  0.051613 -0.833165 -1.076762 -0.107108
2013-01-04  0.251971  0.662593  0.372430  0.703250
2013-01-05  1.512808 -0.011024  0.011468 -1.934990
2013-01-06 -0.087220 -0.882336 -0.722322 -1.032973

Boolean Indexing

In [220]:
df[df["A"]>0]

                   A         B         C         D
2013-01-03  0.051613 -0.833165 -1.076762 -0.107108
2013-01-04  0.251971  0.662593  0.372430  0.703250
2013-01-05  1.512808 -0.011024  0.011468 -1.934990

In [221]:
df[df>0]

                   A         B         C        D
2013-01-01       NaN       NaN       NaN      NaN
2013-01-02       NaN       NaN       NaN      NaN
2013-01-03  0.051613       NaN       NaN      NaN
2013-01-04  0.251971  0.662593  0.372430  0.70325
2013-01-05  1.512808       NaN  0.011468      NaN
2013-01-06       NaN       NaN       NaN      NaN

In [222]:
df2 = df.copy()

In [223]:
df2["E"] = ["one","one","two","three","four","three"]

In [224]:
df2

                   A         B         C         D      E
2013-01-01 -0.109838 -0.157917 -1.068249 -0.886861    one
2013-01-02 -1.431959 -0.675223 -0.013039 -1.146839    one
2013-01-03  0.051613 -0.833165 -1.076762 -0.107108    two
2013-01-04  0.251971  0.662593  0.372430  0.703250  three
2013-01-05  1.512808 -0.011024  0.011468 -1.934990   four
2013-01-06 -0.087220 -0.882336 -0.722322 -1.032973  three

Setting

In [225]:
s1 = pd.Series([1,2,3,4,5,6],index=pd.date_range("20130102",periods=6))

In [226]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [227]:
df["F"]=s1

In [228]:
df.at[dates[0],"A"]=0

In [229]:
df.iat[0,1]=0

df.at(row_label, column_label) is used with labels... df.iat(row_index, column_index) is used with row and column integer index starting from

In [230]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -1.068249 -0.886861  NaN
2013-01-02 -1.431959 -0.675223 -0.013039 -1.146839  1.0
2013-01-03  0.051613 -0.833165 -1.076762 -0.107108  2.0
2013-01-04  0.251971  0.662593  0.372430  0.703250  3.0
2013-01-05  1.512808 -0.011024  0.011468 -1.934990  4.0
2013-01-06 -0.087220 -0.882336 -0.722322 -1.032973  5.0

In [231]:
df.loc[:,"D"]=np.array([5]*len(df))

In [232]:
len(df)

6

In [233]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -1.068249  5.0  NaN
2013-01-02 -1.431959 -0.675223 -0.013039  5.0  1.0
2013-01-03  0.051613 -0.833165 -1.076762  5.0  2.0
2013-01-04  0.251971  0.662593  0.372430  5.0  3.0
2013-01-05  1.512808 -0.011024  0.011468  5.0  4.0
2013-01-06 -0.087220 -0.882336 -0.722322  5.0  5.0

In [234]:
df2 = df.copy()

In [235]:
df2[df2>0]= -df2
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -1.068249 -5.0  NaN
2013-01-02 -1.431959 -0.675223 -0.013039 -5.0 -1.0
2013-01-03 -0.051613 -0.833165 -1.076762 -5.0 -2.0
2013-01-04 -0.251971 -0.662593 -0.372430 -5.0 -3.0
2013-01-05 -1.512808 -0.011024 -0.011468 -5.0 -4.0
2013-01-06 -0.087220 -0.882336 -0.722322 -5.0 -5.0

Missing Data

In [236]:
df1 = df.reindex(index=dates[0:4], columns =list(df.columns)+["E"])
df1

                   A         B         C    D    F   E
2013-01-01  0.000000  0.000000 -1.068249  5.0  NaN NaN
2013-01-02 -1.431959 -0.675223 -0.013039  5.0  1.0 NaN
2013-01-03  0.051613 -0.833165 -1.076762  5.0  2.0 NaN
2013-01-04  0.251971  0.662593  0.372430  5.0  3.0 NaN

In [237]:
df1.loc[dates[0]: dates[1],"E"]=1

In [238]:
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -1.068249  5.0  NaN  1.0
2013-01-02 -1.431959 -0.675223 -0.013039  5.0  1.0  1.0
2013-01-03  0.051613 -0.833165 -1.076762  5.0  2.0  NaN
2013-01-04  0.251971  0.662593  0.372430  5.0  3.0  NaN

Drop Missing Values

In [239]:
df1.dropna(how="any", axis=1)
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -1.068249  5.0  NaN  1.0
2013-01-02 -1.431959 -0.675223 -0.013039  5.0  1.0  1.0
2013-01-03  0.051613 -0.833165 -1.076762  5.0  2.0  NaN
2013-01-04  0.251971  0.662593  0.372430  5.0  3.0  NaN

In [240]:
p=df1.dropna(how="all", axis=1)

In [241]:
p

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -1.068249  5.0  NaN  1.0
2013-01-02 -1.431959 -0.675223 -0.013039  5.0  1.0  1.0
2013-01-03  0.051613 -0.833165 -1.076762  5.0  2.0  NaN
2013-01-04  0.251971  0.662593  0.372430  5.0  3.0  NaN

In [242]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -1.068249  5.0  NaN
2013-01-02 -1.431959 -0.675223 -0.013039  5.0  1.0
2013-01-03  0.051613 -0.833165 -1.076762  5.0  2.0
2013-01-04  0.251971  0.662593  0.372430  5.0  3.0
2013-01-05  1.512808 -0.011024  0.011468  5.0  4.0
2013-01-06 -0.087220 -0.882336 -0.722322  5.0  5.0

In [243]:
df3 = df.copy()

In [244]:
df3

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -1.068249  5.0  NaN
2013-01-02 -1.431959 -0.675223 -0.013039  5.0  1.0
2013-01-03  0.051613 -0.833165 -1.076762  5.0  2.0
2013-01-04  0.251971  0.662593  0.372430  5.0  3.0
2013-01-05  1.512808 -0.011024  0.011468  5.0  4.0
2013-01-06 -0.087220 -0.882336 -0.722322  5.0  5.0

While using df.dropna function ,,, axis= 0 to remove row , 1 to remove column ... how="any" removes row/column if there is any missing value in the row/column .............. how = "all" removes the row./column only if all the value in the row or column are NaN

In [245]:
df5 = df3.dropna(axis=1, how="any")
df5

                   A         B         C    D
2013-01-01  0.000000  0.000000 -1.068249  5.0
2013-01-02 -1.431959 -0.675223 -0.013039  5.0
2013-01-03  0.051613 -0.833165 -1.076762  5.0
2013-01-04  0.251971  0.662593  0.372430  5.0
2013-01-05  1.512808 -0.011024  0.011468  5.0
2013-01-06 -0.087220 -0.882336 -0.722322  5.0

Operations

In [248]:
df.rename(columns={"F":"E"},inplace=True)
df

                   A         B         C    D    E
2013-01-01  0.000000  0.000000 -1.068249  5.0  NaN
2013-01-02 -1.431959 -0.675223 -0.013039  5.0  1.0
2013-01-03  0.051613 -0.833165 -1.076762  5.0  2.0
2013-01-04  0.251971  0.662593  0.372430  5.0  3.0
2013-01-05  1.512808 -0.011024  0.011468  5.0  4.0
2013-01-06 -0.087220 -0.882336 -0.722322  5.0  5.0

In [247]:
df.mean()

A    0.049536
B   -0.289859
C   -0.416079
D    5.000000
E    3.000000
dtype: float64

In [249]:
df.mean(axis=0)

A    0.049536
B   -0.289859
C   -0.416079
D    5.000000
E    3.000000
dtype: float64

In [250]:
df.mean(axis=1)

2013-01-01    0.982938
2013-01-02    0.775956
2013-01-03    1.028337
2013-01-04    1.857399
2013-01-05    2.102650
2013-01-06    1.661625
Freq: D, dtype: float64

In [251]:
s= pd.Series([1,2,5,np.nan,6,8],index=dates).shift(2)

In [252]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    2.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64